app/views/cart_items/index.html.erb

                <div class="col-md-2">
                  <% if cart_item.product.image_url.present? %>
---
SELECT "products".* FROM "products" WHERE "products"."id" IN (1, 5)