app/controllers/cart_items_controller.rb

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."user_id" = 1
SELECT "products".* FROM "products" WHERE "products"."id" IN (1, 5)
---
  def index
    @cart_items = current_user.cart_items.includes(:product)
    @total = @cart_items.sum { |item| item.total_price }

SELECT "products".* FROM "products" WHERE "products"."id" = 1 LIMIT 1
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."user_id" = 1 AND "cart_items"."product_id" = 1 LIMIT 1
INSERT INTO "cart_items" ("user_id", "product_id", "quantity", "created_at", "updated_at") VALUES (1, 1, 1, '2025-08-21 10:48:32.102970', '2025-08-21 10:48:32.102970') RETURNING "id"
UPDATE "cart_items" SET "quantity" = 2, "updated_at" = '2025-08-21 14:07:33.255850' WHERE "cart_items"."id" = 3
---
  def create
    @product = Product.find(params[:product_id])
    @cart_item = current_user.cart_items.find_by(product: @product)

    if @cart_item
      @cart_item.quantity += params[:cart_item][:quantity].to_i
    else
      @cart_item = current_user.cart_items.build(cart_item_params)
      @cart_item.product = @product
    end

    if @cart_item.save