app/controllers/home_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (1, 2, 3)
SELECT "products".* FROM "products" WHERE (stock_quantity > 0) LIMIT 8
---
  def index
    @featured_products = Product.includes(:category).available.limit(8)