app/controllers/orders_controller.rb

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."user_id" = 1
SELECT "products".* FROM "products" WHERE "products"."id" IN (1, 5)
SELECT 1 AS one FROM "cart_items" WHERE "cart_items"."user_id" = 1 LIMIT 1
SELECT "products".* FROM "products" WHERE "products"."id" = 1
---
  def create
    @cart_items = current_user.cart_items.includes(:product)

    if @cart_items.empty?
      redirect_to cart_items_path, alert: 'Your cart is empty.'
      return
    end

    @order = current_user.orders.build(
      total: @cart_items.sum { |item| item.total_price },
      status: :pending,
      shipping_address: params[:order][:shipping_address]
    )

    if @order.save
      @cart_items.each do |cart_item|
        @order.order_items.create!(
          product: cart_item.product,
          quantity: cart_item.quantity,
          price: cart_item.product.price
        )