app/controllers/products_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (1, 2, 3, 4, 5, 6, 7)
SELECT "products".* FROM "products" WHERE (stock_quantity > 0) AND "products"."category_id" = 2
SELECT "categories".* FROM "categories" WHERE "categories"."id" = 2
---
  def index
    @products = Product.includes(:category).available
    @categories = Category.all

    if params[:category_id].present?
      @products = @products.where(category_id: params[:category_id])
    end

    if params[:search].present?
      @products = @products.where("name LIKE ? OR description LIKE ?",
                                  "%#{params[:search]}%", "%#{params[:search]}%")