app/views/products/show.html.erb

SELECT "products".* FROM "products" WHERE "products"."category_id" = 1 AND "products"."id" != 2 AND (stock_quantity > 0) LIMIT 4
---
    <div class="row">
      <% @product.category.products.where.not(id: @product.id).available.limit(4).each do |related_product| %>