app/views/layouts/application.html.erb

SELECT 1 AS one FROM "cart_items" WHERE "cart_items"."user_id" = 1 LIMIT 1
SELECT SUM("cart_items"."quantity") FROM "cart_items" WHERE "cart_items"."user_id" = 1
---
                  <i class="fas fa-shopping-cart"></i> Cart
                  <% if current_user.cart_items.any? %>
                    <span class="badge bg-danger"><%= current_user.cart_items.sum(:quantity) %></span>